package com.lineate.threads;

public class Task17 {
    /**
     * Реализовать очередь многостадийных  задач.
     * Многостадийная задача - экземпляр класса Task, имеющего список из стадий - List<Executable>,
     * где Executable - интерфейс из задания 16.
     * Потоки - разработчики ставят в очередь экземпляры Task аналогично (15),
     * потоки - исполнители берут из очереди задачу, исполняют очередную ее стадию,
     * после чего, если это не последняя стадия,  ставят задачу обратно в очередь.
     * Количество тех и других потоков может быть любым и определяется в main.
     */
}
